게임 시장 데이터 분석 프로그램 매뉴얼

<소개>

이 프로그램은 게임 시장 데이터를 분석하고 시각화하는 데 도움을 주는 도구입니다. 


<사용법>

'test': 가설 검정 수행. 
        'mobile_profit', 'console_profit', 'console_proportion' 입력 가능 

'year': 특정 년도의 정규분포표 시각화
        원하는 년도 입력 ex) 2019, 2021

'line': 데이터 선 그래프 시각화
        'proportion' - 점유율 선 그래프 
         'sales' - 매출액 선 그래프 

'country':다양한 국가의 데이터 막대 그래프로 시각화
          사용자는 원하는 국가 입력 ex) USA , KOREA

<사용 예시>

1. 가설 검정: 'test'를 선택한 후에는 'mobile_profit', 'console_profit', 'console_proportion' 중 하나를 선택하여 해당 카테고리의 가설 검정을 수행할 수 있습니다.

2. 특정 년도의 정규분포표 확인: 'year'를 선택한 후에는 확인하고자 하는 년도를 입력하여 해당 년도의 정규분포표를 확인할 수 있습니다.

3. 선 그래프로 데이터 시각화: 'line'을 선택한 후에는 'proportion' 또는 'sales' 중 하나를 선택하여 점유율이나 매출과 같은 데이터를 선 그래프로 시각화할 수 있습니다.

4. 막대 그래프로 국가별 데이터 시각화: 'country'를 선택한 후에는 원하는 국가를 선택하여 해당 국가의 게임 시장 데이터를 막대 그래프로 시각화할 수 있습니다.

<오류 처리>

사용자가 잘못된 입력을 했을 때 프로그램은 해당 오류를 감지하고 사용자에게 오류 메시지를 표시하여 다시 시도하도록 안내합니다.

<프로그램 종료>

사용자가 모든 작업을 마치고 프로그램을 종료하려면 간단히 창을 닫거나 종료할 수 있습니다. 종료하기 전에 필요한 모든 작업을 완료했는지 확인하세요.
